app/Models/DefaultModel.php

SELECT *
FROM `default`
WHERE `key` = 'solution_name'
 LIMIT 1
---
    public function getSetting($key)
    {
        return $this->where('key', $key)->first()['value'] ?? null;