app/Controllers/Board/BoardController.php

    public function index($tableName)
    {
        if (!$this->db->tableExists($tableName)) {
            return redirect()->to('/')->with('error', '존재하지 않는 게시판입니다.');
        }

        // 게시판 이름 가져오기
        $boardInfo = $this->db->table('board_list')
            ->select('board_name')
            ->where('board_table', $tableName)
            ->get()
            ->getRowArray();
---
SELECT `board_name`
FROM `board_list`
WHERE `board_table` = 'board_test'